app/controllers/attendance_controller.rb

SELECT "students".* FROM "students"
---
	def new
	 	@attendance = Attendance.new
	 	@student =Student.all

INSERT INTO "attendances" ("day", "status", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["day", "2016-10-02 00:00:00.000000"], ["status", "f"], ["student_id", 3], ["created_at", "2016-10-12 12:35:39.030052"], ["updated_at", "2016-10-12 12:35:39.030052"]]
---
	def create
		 @attendance = Attendance.new(attendance_params)

   	 @attendance.save

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@attendance = Attendance.find(params[:id])

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT 1  [["id", 3]]
---
	def show
		@attendance = Attendance.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "attendances".* FROM "attendances" WHERE (student_id=#<Student:0x007fad48b03e50>)  ORDER BY "attendances"."id" ASC LIMIT 1
---
	def student_attendance
		@student = Student.find(params[:id])
		@attend= Attendance.where("student_id=#{@student.id}")