app/controllers/exam_controller.rb

	def index
		@exams=Exam.all
---
SELECT "exams".* FROM "exams"

	def edit
		@exam = Exam.find(params[:id])
---
SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 3]]

	def show
		@exam = Exam.find(params[:id])
---
SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@exam = Exam.find(params[:id])

      @exam.update_attributes(exam_params)
---
SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "exams" SET "ExamName" = $1, "updated_at" = $2 WHERE "exams"."id" = $3  [["ExamName", "final exam"], ["updated_at", "2016-10-13 10:21:01.705270"], ["id", 3]]