app/controllers/result_controller.rb

INSERT INTO "results" ("marks", "student_id", "exam_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["marks", 99], ["student_id", 1], ["exam_id", 1], ["created_at", "2016-10-13 10:47:14.104242"], ["updated_at", "2016-10-13 10:47:14.104242"]]
---
	def create
		 @result = Result.new(result_params)

   	 @result.save

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@result = Result.find(params[:id])

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@result = Result.find(params[:id])

SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "results" SET "marks" = $1, "updated_at" = $2 WHERE "results"."id" = $3  [["marks", 69], ["updated_at", "2016-10-13 10:43:18.313124"], ["id", 1]]
---
	def update
		@result = Result.find(params[:id])

      @result.update_attributes(result_params)

DELETE FROM "results" WHERE "results"."id" = $1  [["id", 1]]
SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT 1  [["id", 1]]
---
	def delete
		 Result.find(params[:id]).destroy