app/controllers/school_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show_standard
	 	@school = School.find(params[:id])

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT 1  [["id", 3]]
---
   def show_section
   	@standard = Standard.find(params[:id])

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 3]]
---
   def student
   @section = Section.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 3]]
---
   def exam
   @student = Student.find(params[:id])

SELECT  "exams".* FROM "exams" WHERE "exams"."id" = $1 LIMIT 1  [["id", 3]]
---
   def result
	@exam = Exam.find(params[:id])

INSERT INTO "schools" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "aaaa"], ["address", "ssss"], ["created_at", "2016-10-12 08:06:33.525581"], ["updated_at", "2016-10-12 08:06:33.525581"]]
---
	def create
		 @school = School.new(school_params)

   	if @school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 6]]
---
	def edit
		@school = School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "schools" SET "name" = $1, "address" = $2, "updated_at" = $3 WHERE "schools"."id" = $4  [["name", "vithyalaya"], ["address", "chidambaram"], ["updated_at", "2016-10-12 09:16:34.257988"], ["id", 6]]
---
	def update
		@school = School.find(params[:id])

      if @school.update_attributes(school_params)

DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 2]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 9]]
---
	def delete
		 School.find(params[:id]).destroy