app/controllers/section_controller.rb

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@section = Section.find(params[:id])

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "sections" SET "sectionName" = $1, "updated_at" = $2 WHERE "sections"."id" = $3  [["sectionName", "Aa"], ["updated_at", "2016-10-13 07:15:34.023605"], ["id", 1]]
---
	def update
		@section = Section.find(params[:id])

      @section.update_attributes(section_params)