app/controllers/standard_controller.rb

SELECT "standards".* FROM "standards"
---
	def index
		@standards=Standard.all

INSERT INTO "standards" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "1"], ["created_at", "2016-10-12 14:19:39.962269"], ["updated_at", "2016-10-12 14:19:39.962269"]]
---
	def create
		 @standard = Standard.new(standard_params)

   	 @standard.save

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT 1  [["id", 13]]
---
	def edit
		@standard = Standard.find(params[:id])

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@standard = Standard.find(params[:id])

DELETE FROM "standards" WHERE "standards"."id" = $1  [["id", 12]]
SELECT  "standards".* FROM "standards" WHERE "standards"."id" = $1 LIMIT 1  [["id", 12]]
---
	def delete
		 Standard.find(params[:id]).destroy