app/controllers/student_controller.rb

	def new
	 	@student = Student.new
	 	@section = Section.all
---
SELECT "sections".* FROM "sections"

	def create
		 @student = Student.new(student_params)

   	if @student.save
---
INSERT INTO "students" ("fname", "lname", "section_id", "dob", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["fname", "priya"], ["lname", "lal"], ["section_id", 2], ["dob", 5], ["address", "kalpakkam"], ["created_at", "2016-10-12 11:50:16.724709"], ["updated_at", "2016-10-12 11:50:16.724709"]]

	def update
		@student = Student.find(params[:id])

      if @student.update_attributes(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "students" SET "address" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["address", "cuddalore"], ["updated_at", "2016-10-12 11:47:42.169798"], ["id", 2]]

	def delete
		 Student.find(params[:id]).destroy
---
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 4]]
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 4]]