app/controllers/subject_controller.rb

	def update
		@subject = Subject.find(params[:id])

      @subject.update_attributes(subject_params)
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "subjects" SET "SubjectName" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["SubjectName", "tamil"], ["updated_at", "2016-10-13 07:59:15.269798"], ["id", 1]]