app/controllers/teacher_controller.rb

SELECT "standards".* FROM "standards"
---
	def new
	 	@teacher = Teacher.new
	 	@standard = Standard.all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "standards".* FROM "standards"
---
	def edit
		@teacher = Teacher.find(params[:id])
    @standard = Standard.all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "teachers" SET "fname" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["fname", "saravana"], ["updated_at", "2016-10-13 09:49:42.908968"], ["id", 1]]
---
	def update
		@teacher = Teacher.find(params[:id])

      if @teacher.update_attributes(teacher_params)

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 1]]
---
	def delete
		 Teacher.find(params[:id]).destroy